{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"So much has happened in the last two weeks. My design boss quit two weeks ago and has since been \"replaced\". My engineering boss's boss quit…","html":"<p>So much has happened in the last two weeks.</p>\n<ul>\n<li>My design boss quit two weeks ago and has since been \"replaced\".</li>\n<li>My engineering boss's boss quit and he has not yet been replaced.</li>\n<li>We paused our effort on a project with Angular2 and Ionic2 (both in beta).</li>\n<li>We began a new project with React and Redux (not in beta).</li>\n<li>I have been running more consistently to build a base as I train to run a 50 miler to qualify for a 100 miler.</li>\n<li>Belmeade was canceled this year.</li>\n<li>My wife had a birthday and mothers day in the same week.</li>\n</ul>\n<p>Many hats have been worn recently. I had planned to write a server so I could get a handle on express but didn't. Instead I got a pretty good handle on Ionic and Angular2. We have since decided that we would give React with Redux and Webpack a go. It's been a challenge but I think it will be a good thing.</p>\n<p>Running has gone well so far. Super small weeks. Last week was on the order of 14 miles. This week is already at 19 and I should hit 25 to 27 by the end of it. Next week continues the upswing and should get all the way to 32. The goal is to be comfortably running 50 mile weeks after 2 months. Ideally this could be accomplished with run commuting which would guarantee 50 miles a week.</p>\n<p>I'm slowly being transitioned from designer to engineer which is a welcome change. Not that I don't want to design but the challenge in developing these apps is fantastic. I have many personal projects that I have struggled to see realized because I don't have the chops to build them. The only way to see them through is to acknowledge my inner engineer and focus solely on that for a time.</p>\n<p>I am not now who I once was nor am I who I will become.</p>","frontmatter":{"date":"160514","title":"Many Hats","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/160501/100-miles-of-memories"}}]},"nextPostMarkdown":{"frontmatter":{"title":"100 Miles of Memories"}},"previousPost":{"edges":[{"node":{"path":"/160515/struggles"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Struggles"}}},"pageContext":{"nextPostPath":"/160501/100-miles-of-memories","previousPostPath":"/160515/struggles"}}