{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Dropped a new plugin yesterday. Learned a bunch of stuff in the process. Faculty are using FeedWordPress to run their courses at VCU and…","html":"<p>Dropped a new plugin yesterday. Learned a bunch of stuff in the process.</p>\n<p>Faculty are using FeedWordPress to run their courses at VCU and elsewhere. The general setup is a Mother > Child blog relationship. Faculty run a mother blog that pulls in posts from their student’s child blogs based on categories relevant to specific assignments.</p>\n<p>The theory in this pedagogy all depends on student engagement and interaction via comments on each other’s articles. The difficulty here is that FeedWordPress works off RSS feeds and the feed that contains posts doesn’t contain those comments. As a result faculty find it difficult/impossible to keep track of who is commenting where and how much. Assessing success in this setup has proven very difficult.</p>\n<p>Martha Burtis wrote a <a href=\"http://wrapping.marthaburtis.net/2014/03/25/remote-comments-plugin-a-fwp-addon/\">nice simple plugin</a> to get the comments count for remote posts. This is nice in that it will show the most popular/controversial posts by comment count but it doesn’t quite satisfy our goals. What we need is a 1000ft view of the conversation. The ability to see a list of posts from students along with the names of commenters and links out to all of this content on the child blogs.</p>\n<p>Martha’s plugin does a good job of finding the rss for comments on each post. That being the primary key to my problem I figured it was a good place to start.</p>\n<p>I spent Tuesday afternoon cracking open Remote Comments to see if I could reconfigure it to grab more than just the comments number. After a lot of digging into our own workflows and those of others I ended up with <a href=\"https://github.com/vcualtlab/list-remote-comments\">List Remote Comments</a>.</p>\n<p>In development, my first goal is always a working prototype. Roughly hewn edges can be sanded out so long as the thing works in the first place. The first step towards this is usually some sort of crude template tag that gets the job done.</p>\n<p>Based on Martha’s work getting to the prototype state was surprisingly quick. The data was there, I just needed to spit it out with some <a href=\"http://simplepie.org/\">SimplePie</a>* functions. Use this tag in the loop and you’re good to go!</p>\n<p><strong>Except you can’t do that here.</strong></p>\n<p>When you are dealing with thousands of users picking their own themes you can’t expect to start dropping custom templates all over the place when you need to modify a query or drop a couple template tags into the loop. <a href=\"http://bionicteaching.com/\">Tom</a> has been handling this with <a href=\"http://www.billerickson.net/\">Bill Erickson’s</a> excellent <a href=\"https://wordpress.org/plugins/display-posts-shortcode/\">Display Posts Shortcode</a>. It allows you to spit out custom queries without getting into the theme weeds. Perfect for this environment.</p>\n<p><strong>Not quite.</strong></p>\n<p>Again with the caveats - I needed to spit out a template tag on the loops that Display Posts is running. But of course you can’t just do that without modifying the plugin. Except you can! Bill has done a fantastic job of making his plugin super extendable with some sweet filters. All I needed to do was appended the output of my template to the output of Bill’s loop. Success!</p>\n<p><strong>Almost.</strong></p>\n<p>The problem now was my template tag appended everywhere Display Posts was used. I really only needed it on specific pages. I tried adding extra arguments to Bill’s shortcode but WordPress ignores any arguments that aren't explicitly coded in. I thought about hi-jacking some of his existing arguments but that’s hacky and not terribly user friendly. Eventually I settled on providing my own shortcode that when placed above the display posts shortcode runs a quick function that adds the filter.</p>\n<div class=\"gatsby-highlight\" data-language=\"php\"><pre class=\"language-php\"><code class=\"language-php\"><span class=\"token keyword\">function</span> <span class=\"token function\">append_to_be_posts</span><span class=\"token punctuation\">(</span> <span class=\"token variable\">$output</span> <span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n\t<span class=\"token variable\">$output</span> <span class=\"token punctuation\">.</span><span class=\"token operator\">=</span> <span class=\"token function\">list_remote_comments</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n\t<span class=\"token keyword\">return</span> <span class=\"token variable\">$output</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token function\">add_shortcode</span><span class=\"token punctuation\">(</span> <span class=\"token single-quoted-string string\">'list-remote-comments'</span><span class=\"token punctuation\">,</span> <span class=\"token single-quoted-string string\">'append_remote_comments_to_be_posts_shortcode'</span><span class=\"token punctuation\">,</span> <span class=\"token number\">9</span> <span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n\n<span class=\"token keyword\">function</span> <span class=\"token function\">append_remote_comments_to_be_posts_shortcode</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">{</span>\n\t<span class=\"token function\">add_filter</span><span class=\"token punctuation\">(</span> <span class=\"token single-quoted-string string\">'display_posts_shortcode_output'</span><span class=\"token punctuation\">,</span> <span class=\"token single-quoted-string string\">'append_to_be_posts'</span><span class=\"token punctuation\">,</span> <span class=\"token number\">9</span> <span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span></code></pre></div>\n<p><strong>Now we’re up and running!</strong></p>\n<p>The last few things things to do at this point were to provide a set of arguments to the template tag should you be in an environment where that sort of workflow is acceptable and also to get some serious caching involved.</p>\n<p>The one final gigantic caveat to this whole thing is how much of a bottle neck it can be. We are reading, parsing, and outputting data from 10, 20, 30, or even more rss feeds. I’ve got caching setup to only check once an hour but I think we could get even more aggressive. Alan Lavine from <a href=\"http://cogdogblog.com/\">CogDogBlog</a> suggested hooking into FeedWordPress itself to see about running things through there. A chron job is also an option. I’ll need to test further to see if any of these really solve this last problem.</p>\n<p>Eventually I’d like to try my hand at getting all this data from the WP-API. Working with JSON feeds can be a lot simpler - or not - depending on all sorts of other variables I have yet to encounter.</p>\n<p>Who knew reading some comments could get so complicated!</p>\n<p><a href=\"https://github.com/vcualtlab/list-remote-comments\">Get the List Remote Comments</a> plugin and full documentation on github.</p>\n<div class=\"meta\" markdown=\"1\" >\n<h4>Notes</h4>\n<p>*I'm not actually sure how or why I have access to SimplePie functions here. Part of WordPress or FeedWordPress? More investigation needed...</p>\n</div>","frontmatter":{"date":"150610","title":"List Remote Comments","illustration":"/assets/posts/list-remote-comments/taking-notes.png","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150606/wp-db-imports-with-vagrant"}}]},"nextPostMarkdown":{"frontmatter":{"title":"WP DB Import with Vagrant"}},"previousPost":{"edges":[{"node":{"path":"/150614/switch-to-blog"}}]},"previousPostMarkdown":{"frontmatter":{"title":"switch_to_blog();"}}},"pageContext":{"nextPostPath":"/150606/wp-db-imports-with-vagrant","previousPostPath":"/150614/switch-to-blog"}}