{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"1. Entrance with Guardian While traveling in the forest the party encounters a frantic squirrel. If the party can speak with animals they…","html":"<h2>1. Entrance with Guardian</h2>\n<p>While traveling in the forest the party encounters a frantic squirrel. If the party can speak with animals they will learn from the squirrel that a local druid has stolen it's acorn stash for winter. It begs the party to find the druid and return it's acorn stash any way possible.</p>\n<h2>2. Puzzle or Roleplaying Challenge</h2>\n<p>The druid can be found in a burnt out section of the forest recently destroyed by fire. The druid is carefully planting acorns from a leather fanny pack, quietly offering a prayer and then stepping back to watch as each acorn quickly sprouts into a large oak tree.</p>\n<p>The druid is carrying a stash of acorns in it's fanny pack. There is another stash in the druid's home within the trunk of a massive oak deep in the forest.</p>\n<p>The squirrel will be happy with either stash.</p>\n<p>The druid will not willingly give the party any acorns if it is revealed that a squirrel wants them. The druid will only give acorns to the party if they agree to plant them and offer up a prayer to the mother.</p>\n<h2>3. Trick or Setback</h2>\n<p>The squirrel eats an acorn and immediately grows into a huge creature 30ft tall. It gains the Might of Oaks with the stats of a Hill Giant. This effect lasts 1 hour per acorn.</p>\n<h2>4. Big Climax</h2>\n<p>The squirrel rages through the forest destroying the trees the druid has planted and making a general mess of things. Deal with it.</p>\n<h2>5. Reward, Revelation</h2>\n<p>The druid did not steal the squirrel's stash. The squirrel saw that the druid had some good looking acorns and tricked the party into getting them. The druid will demand any remaining acorns be returned if the party gave them to the squirrel.</p>\n<p>The acorns will provide the same bonus to a player who eats them as they did the squirrel.</p>\n<h2>Spice things up a bit</h2>\n<p>A single squirrel with the stats of a Hill Giant not tough enough for you? Have the squirrel share with his friends raccoon and badger. Or use the stats of a more formidable giant. Maybe the druid is so angry at the parties carelessness that he also attacks and the party is now fighting on two fronts!</p>\n<h2>Take things further</h2>\n<p>The party is hounded by woodland creatures showing at the most inopportune times looking for just one more acorn.</p>","frontmatter":{"date":"190108","title":"The Druid and the Squirrel","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"forest-gump.jpg","publicURL":"/static/forest-gump-cb60a493d812bb1e574418382f053dce.jpg"}},{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/190101/new-look-same-great-taste"}}]},"nextPostMarkdown":{"frontmatter":{"title":"New Look, Same Great Taste!"}},"previousPost":null,"previousPostMarkdown":null},"pageContext":{"nextPostPath":"/190101/new-look-same-great-taste","previousPostPath":null}}