{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"A Five Room Dungeon 1. Entrance with Guardian While traveling in the forest the party encounters a frantic squirrel. If the party can speak…","html":"<p><a href=\"http://strolen.com/viewing/5_Room_Dungeon\">A Five Room Dungeon</a></p>\n<h2>1. Entrance with Guardian</h2>\n<p>While traveling in the forest the party encounters a frantic squirrel. If the party can speak with animals they will learn from the squirrel that a local Druid has stolen it's acorn stash for winter. It begs the party to find the Druid and return it's acorn stash any way possible.</p>\n<h2>2. Puzzle or Roleplaying Challenge</h2>\n<p>The Druid can be found in a burnt out section of the forest recently destroyed by fire. </p>\n<p>If left undisturbed the Druid will carefully remove an acorn from a leather fanny pack and plant it in the charred earth. After quietly offering a prayer the acorn will quickly sprout into a large oak tree.</p>\n<p>There are two stashes of acorns, one in the Druid's fanny pack and the other in his home. The Druid lives within the trunk of a massive oak deep in the forest. The home is difficult to locate but is ungaurded and unlocked.</p>\n<p>The squirrel will be happy with either stash.</p>\n<p>The Druid will willingly share the acorns with the party if they agree to assist in replanting the forest. If the party mentions the squirrel the Druid will scoff at the idea that he stole anything and will no longer share the acorns willingly.</p>\n<h2>3. Trick or Setback</h2>\n<p>The squirrel eats an acorn and immediately grows into a huge creature 30ft tall. It gains the Might of Oaks with the stats of a Hill Giant. This effect lasts 1 hour per acorn.</p>\n<h2>4. Big Climax</h2>\n<p>The squirrel rages through the forest destroying the trees the Druid has planted and making a general mess of things. Deal with it.</p>\n<h2>5. Reward, Revelation</h2>\n<p>The Druid did not steal the squirrel's stash. The squirrel saw that the Druid had some good looking acorns and tricked the party into getting them. The Druid will demand any remaining acorns be returned if he realizes the party gave them to the squirrel.</p>\n<p>The acorns will provide the same bonus to a player who eats them as they did the squirrel.</p>\n<h2>Take things further</h2>\n<p>Within this forest the party is forever hounded by woodland creatures at the most inopportune times begging for just one more acorn.</p>\n<h2>Spice things up a bit</h2>\n<p>A single squirrel with the stats of a Hill Giant not tough enough for you? Have the squirrel share with his friends raccoon and badger. Or use the stats of a more formidable giant. Maybe the Druid is so angry at the parties carelessness that he also attacks and the party is now fighting on two fronts!</p>","frontmatter":{"date":"190108","title":"The Druid and the Squirrel","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"forest-gump.jpg","publicURL":"/static/forest-gump-cb60a493d812bb1e574418382f053dce.jpg"}},{"node":{"relativePath":"ball-bouncing.gif","publicURL":"/static/ball-bouncing-08773357003ecdc0ca6243769528e2c1.gif"}},{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}},{"node":{"relativePath":"neistat.png","publicURL":"/static/neistat-ef667e42ff76189bfb9374db77d8a5f3.png"}},{"node":{"relativePath":"walks.gif","publicURL":"/static/walks-b81a25df3b9c73ec6bb0a083f0d940c2.gif"}},{"node":{"relativePath":"ball-spinning.gif","publicURL":"/static/ball-spinning-584cbc3260dd8d37d2dc4d57d4fe15ea.gif"}},{"node":{"relativePath":"cerebral-flab.png","publicURL":"/static/cerebral-flab-00a3862364464b2078d0f518fd91e8b9.png"}},{"node":{"relativePath":"double-take.gif","publicURL":"/static/double-take-7c966447b035acc49491fbdcdb6a30b4.gif"}},{"node":{"relativePath":"CA-190805-PO5.png","publicURL":"/static/CA-190805-PO5-8f4d2c8fdad23dd34a37a5a78ead1ad1.png"}}]},"nextPost":{"edges":[{"node":{"path":"/190101/new-look-same-great-taste"}}]},"nextPostMarkdown":{"frontmatter":{"title":"New Look, Same Great Taste!"}},"previousPost":{"edges":[{"node":{"path":"/190305/neistat"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Neistat"}}},"pageContext":{"nextPostPath":"/190101/new-look-same-great-taste","previousPostPath":"/190305/neistat"}}