{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"I often tell my son to be a net creator instead of a net consumer. It’s my go to reason for why I don’t let him play video games or watch tv…","html":"<p>I often tell my son to be a net creator instead of a net consumer. It’s my go to reason for why I don’t let him play video games or watch tv at any given moment.</p>\n<p>Lately I haven’t exactly been a shining example for him. Instead of driving out with my son to see some flooding from a weekend storm I sat inside and binged on Reddit. Not exactly the ideals I’m trying to instill in my son.</p>\n<p>Thus.</p>\n<p>Every day for the next year I will create a blog post about something I did that was genuinely creative. Creations won’t always be physical. Creation of lasting memories are just as valuable if not more so than of some physical piece of art. Considering my penchant for being a home body it may be far more challenging to get my butt out the door.</p>\n<p>This leaves things fairly loose which is good I think. The last time I did something like this with a drawing a day on Instagram I felt trapped. Drawings felt forced. I would rush through them like a  task that needed only to be checked off. The same thing happened on my run everyday kick that lasted 50 days. Previously I had been running 5-10 miles a few days a week. During the run streak I was doing 1 mile sprints just to chalk up another day, never stopping to actually enjoy the run itself and actually running far less than I had been before.</p>\n<p>Will this end in me doing “creative” things just to chalk up another day?</p>\n<p>Maybe.</p>\n<p>But I have two kids that look to me as an example whether I want them to or not. I’d much rather teach them to get in the car and go look for lightening on stormy Saturday than curl up in a blanket and binge on Reddit.</p>","frontmatter":{"date":"160418","title":"Net Creator","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150826/wordpress-and-angular"}}]},"nextPostMarkdown":{"frontmatter":{"title":"WordPress and Angular"}},"previousPost":{"edges":[{"node":{"path":"/160418/dungeons-of-five-nights-at-freddys"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Dungeons of Five Nights at Freddy's"}}},"pageContext":{"nextPostPath":"/150826/wordpress-and-angular","previousPostPath":"/160418/dungeons-of-five-nights-at-freddys"}}