{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Having spent a fair amount of time recently tinkering with Mother Blogs it became apparent that another challenge we face is the ability to…","html":"<!--\nHaving spent a fair amount of time recently tinkering with Mother Blogs it became apparent that another challenge we faced was the ability to provide any sort of meaningful analysis of the data we were collecting. That data is important. Fat lot of good that data'll do you when it's locked up in the database.\n -->\n<p>Having spent a fair amount of time recently tinkering with Mother Blogs it became apparent that another challenge we face is the ability to provide any sort of meaningful analysis of the data we are collecting. We have plenty of course content from students for grading and assessment but it's locked in stubborn wordpress databases accessable only through generic and clunky interfaces not designed to do what we're asking.</p>\n<p>So I took a stab at unlocking that data for David Croteau's Sociology course here at VCU. Two seperate implementations below:</p>\n<ul>\n<li><a href=\"http://rampages.us/grandma-socy/blogs-view/\">Blogs View</a></li>\n<li><a href=\"http://rampages.us/grandma-socy/conversation-view/\">Conversation View</a></li>\n</ul>\n<h2>So what do we have here?</h2>\n<p>Sorting by author is now possible as shown here:</p>\n<p><img src=\"https://i.imgur.com/QUOIKwZ.gif\" alt=\"sort by author\"></p>\n<p>Some things to note. First we count all blog posts on the mother blog, then we count our results based on author and or keyword search. Finally we do a quick calculation to get the percentage of our results from the entire activity across all of our student's blogs.</p>\n<p>When searching per student this is a quick and easy way of getting a count of their contributions and how they relate to the rest of the group in terms of productivity. Links to each post provide easy access to the full content allowing for proper assessment or further engagement.</p>\n<p>We can also search by keyword.</p>\n<p><img src=\"https://i.imgur.com/uACit7X.gif\" alt=\"sort by keyword\"></p>\n<p>When searching by keyword our analytics are the same but can provide some very different and very valuable insights. We see here that of the 184 blog posts we have 5 that contain the word \"confederate\". This is very likely due to the prominence of the subject in the news recently and VCU's location in particular.</p>\n<h2>how does this work?</h2>\n<p>First I aggregated all the posts and comments from David's students into this one site. Then I added <a href=\"https://github.com/VCUarts/benson\">Benson</a> and <a href=\"https://wordpress.org/plugins/json-rest-api/\">WP-API</a>. Benson is a utility plugin I built at VCUarts to create an Angular controller and add a JSON feed into $scope making Angular templates in wordpress a piece of cake. Finally I started <a href=\"https://github.com/vcualtlab/bensonstats\">Benson Stats</a> yesterday which aims to provide canned analytics such as this via shortcode. More cans coming soon :)</p>\n<p>So while this is a series of plugins taped together to provide somewhat complex functionality the workflow itself isn't actually that complex.</p>\n<p>To implement this on your own site you can do the following:</p>\n<ol>\n<li>Aggregate your content.<br/>\nI suggest having a category for blog posts and category for comments.\n<a href=\"https://github.com/vcualtlab/motherblog\">ALT Lab MotherBlog</a> and <a href=\"https://wordpress.org/plugins/feedwordpress/\">FeedWordPress</a> can help with that.</li>\n<li>Some plugins you will need ti install<br/>\n<a href=\"https://wordpress.org/plugins/json-rest-api/\">WP-API</a><br/>\n<a href=\"http://www.advancedcustomfields.com/\">Advanced Custom Fields</a> (required by benson, for now at least)<br/>\n<a href=\"https://github.com/VCUarts/benson\">Benson</a><br/>\n<a href=\"https://github.com/vcualtlab/bensonstats\">Benson Stats</a></li>\n<li>Find an appropriate endpoint for the content you want to sift through.<br/>\nex. <a href=\"http://yoursite.com/wp-json/posts?filter%5Bcategory_name%5D=blog-posts\">http://yoursite.com/wp-json/posts?filter[category_name]=blog-posts</a><br/>\nsee <a href=\"http://wp-api.org/\">wp-api.org</a> for more info on building endpoints</li>\n<li>Add the shortcode [sifter] to a post or page per the Benson Stats documentation on <a href=\"https://github.com/vcualtlab/bensonstats\">github</a>.</li>\n</ol>\n<h2>beyond the mother blog</h2>\n<p>This was all created as way to understand the data on our Mother Blogs better but it doesn't need stop there. This could provide meaningful data of a personal blog or even serve as a way to find duplicate content and site creep on a large install.</p>\n<p>Lots more cans coming soon, so much data to sort!</p>","frontmatter":{"date":"150708","title":"Canned Analytics with Benson Stats","illustration":"/assets/posts/150708/illustration.png","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150630/mother-blogs-made-easier"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Mother Blogs Made Easier"}},"previousPost":{"edges":[{"node":{"path":"/150728/mother-blogs-made-better"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Mother Blogs Made Better"}}},"pageContext":{"nextPostPath":"/150630/mother-blogs-made-easier","previousPostPath":"/150728/mother-blogs-made-better"}}