{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Casey Neistat. That guy is cool. So cool in fact that I wanted nothing to do with him cause, well, reasons? A friend of mine used to watch…","html":"<p>Casey Neistat.</p>\n<p>That guy is cool. So cool in fact that I wanted nothing to do with him cause, well, reasons?</p>\n<p>A friend of mine used to watch his videos at work while designing. Curious - given my wholly unearned lack of respect for Casey Neistat and wholly earned respect for said friend - I asked what was so interesting about the guy. He's so wierd looking... He wears sunglasses inside... No way that studio is for real...</p>\n<p>He didn't have a great answer.</p>\n<p>So I continued to not watch any of his videos for years.</p>\n<p>A couple months ago in one of my late night alcohol fueled Youtube binges a Neistat video showed up in my recommended list. C'mon Youtube - this guy is too cool for school. I don't want this.</p>\n<p>But caught in a moment of trying to expand my horizons I decided I should try and grow beyond my middle school self.</p>\n<p>It was time I stopped disliking things for... reasons?</p>\n<p>So I gave it a go. Figured I should at least be able to articulate why I didn't care for the guy.</p>\n<p>And I quickly figured it out.</p>\n<p>I was jealous.</p>\n<p>This guy is seriously talented. Seriously disiplined. Lives in NYC. Came from nothing. And that studio is totally real.</p>\n<p>Fuck.</p>\n<p>What am I doing with my life?</p>\n<p>Getting drunk late at night and watching youtube by myself. That's what.</p>\n<p>So I turned it off halfway through. Too painful. It was time to reminisce about how productive and talented I used to be. Dust off the old comics and artifacts of productivity I made in times of yore. <em>I'm</em> talented. <em>I'm</em> disciplined... who was I kidding? I was drunk for the who knows how many nights in a row. I wasn't over the last year and all the bullshit that was. I was setting a shit example for my kids as a highly functional alcoholic.</p>\n<p>This is not the life I want.</p>\n<p>This is not the life I want for my kids.</p>\n<p>This is not my beautiful house.</p>\n<p>How did I get here?</p>\n<p>Slowly.</p>\n<p>Ever so slowly I have been digging myself out of a hole.</p>\n<p>Neistat's videos are badass because they embody flow. That magical creative place we go to when all the pieces just click. When it feels easier than it is. When you look at the clock and realize you skipped lunch and are now 3 pages ahead.</p>\n<p><em><strong>And fucking starving.</strong></em></p>\n<p>There is a feeling to his videos that I miss.</p>\n<p>That feeling is all about being scrappy. It's about working your ass off. It's about using your resources. It's about being a net creator.</p>\n<p>He's scrappy.</p>\n<p>He works his ass off.</p>\n<p>He has earned it all.</p>\n<p>Kudos.</p>","frontmatter":{"date":"190305","title":"Neistat","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"forest-gump.jpg","publicURL":"/static/forest-gump-cb60a493d812bb1e574418382f053dce.jpg"}},{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/190108/the-druid-and-the-squirrel"}}]},"nextPostMarkdown":{"frontmatter":{"title":"The Druid and the Squirrel"}},"previousPost":null,"previousPostMarkdown":null},"pageContext":{"nextPostPath":"/190108/the-druid-and-the-squirrel","previousPostPath":null}}