{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"So much improvement! About a month ago I released the first version of  ALT Lab Mother Blog , a plugin that greatly simplified the…","html":"<p>So much improvement!</p>\n<p>About a month ago I released the first version of <a href=\"https://github.com/vcualtlab/motherblog\">ALT Lab Mother Blog</a>, a plugin that greatly simplified the motherblog signup process. Since then I've squashed a bunch of bugs, rewritten much of the plugin, and added a bunch of needed features.</p>\n<h2>New Features</h2>\n<p><strong>Subscribe to comments</strong></p>\n<p>To subscribe to all comments within your chosen category add <code class=\"language-text\">get_comments=&quot;true&quot;</code> to the [altlab_motherblog] shortcode. This will bring in all comments to posts within the specified categories to the mother blog as well. The one catch here is the comments come in as posts without any category associated at all. This is ok in that it seperates them well enough from the posts themselves and can be categorized later but ideally we would have them categorized automatically. Something for the future...</p>\n<p><strong>Prevent Duplicate Signups</strong></p>\n<p>During testing it became apparent that a student could signup as many times as they wanted. This didn't actually duplicate content as FWP seems smart enough to pull once from a group of identical feeds rather than once from each but it still duplicated the feeds and links. This was more of a hassle in the admin area than anything else but should no longer be an issue as we check the feed against the existing links before adding any new ones. If you try and signup twice you will be met with a nice little error that lets you know you're already signed up.</p>\n<p><strong>Sub Categories</strong></p>\n<p>Yes! We now have sub categories. A use case for this would be a class with weekly projects. Students sign up for your course with the main category and then receive sub categories for each weekly project. As they progress through the semester students need only check the appropriate category for each week's assignment. Then on your mother blog you can easily sort projects by the predefined categories.</p>\n<p>Just add sub<em>categories with a comma separated list of category name like this: `sub</em>categories = \"cat1, cat2,cat3,  cat4\"` to the [altlab_motherblog] shortcode. </p>\n<h2>Bugs Mushed</h2>\n<p><strong>Current user role change</strong></p>\n<p>Suppose you are making a mother blog and want another of your sites on the network signed up. Previously this would reassign your user role to subscriber. No more. We check if you are already a user before adding and setting a role.</p>\n<p><strong>Technical muck</strong></p>\n<p>A bunch of uninteresting mumbo jumbo. If you really want to see the rest go check it out on <a href=\"https://github.com/vcualtlab/motherblog/\">github</a>.</p>\n<h2>To Dos</h2>\n<ul>\n<li>Check for role before populating dropdown - to prevent signups of other motherblogs that a student happens to be a subscriber of.</li>\n<li>Add category to comments</li>\n</ul>","frontmatter":{"date":"150728","title":"Mother Blogs Made Better","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150708/canned-analytics-with-bensonstats"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Canned Analytics with Benson Stats"}},"previousPost":{"edges":[{"node":{"path":"/150811/update-your-mother-blog"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Update Your Mother Blog"}}},"pageContext":{"nextPostPath":"/150708/canned-analytics-with-bensonstats","previousPostPath":"/150811/update-your-mother-blog"}}