{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Jekyll has fantastic documentation. And getting started with Jekyll couldn't be any easier! Direct from the below is the Quick-start guide…","html":"<p>Jekyll has fantastic documentation. And getting started with Jekyll couldn't be any easier! Direct from the below is the Quick-start guide to getting started with Jekyll. ☟</p>\n<div class=\"gatsby-highlight\" data-language=\"sh\"><pre class=\"language-sh\"><code class=\"language-sh\">~ $ gem install jekyll\n~ $ jekyll new my-awesome-site\n~ $ cd my-awesome-site\n~/my-awesome-site $ jekyll serve\n# =&gt; Now browse to http://localhost:4000</code></pre></div>\n<p>...if any of that looks familiar to you, you probably don't need to read any further. Just head over to the Jekyll docs and have at it. You'll be fine. For the rest of you that have that no idea what to do with any of those squigglies and dollar signs, stick around. We'll work through it.</p>\n<h2>Requirements</h2>\n<p>Before we get into what that mess above is there are some <a href=\"http://jekyllrb.com/docs/installation/\">requirements</a>. Jekyll runs on Linux, Unix, and Mac OS X as well as Windows. Unfortunately, <a href=\"http://jekyllrb.com/docs/windows/#installation\">Windows installation</a> is a bit different, has it's own docs, and is beyond the scope of this guide. For our purposes I will assume we are all working on a Mac.</p>\n<p><strong>Xcode</strong></p>\n<p>Working with Jekyll requires a few terminal commands. For that we need to install <a href=\"https://itunes.apple.com/us/app/xcode/https://itunes.apple.com/us/app/xcode/id497799835?mt=12\">Xcode</a>. Xcode is pretty large. You may wanna grab a coffee while it downloads.</p>\n<p>All downloaded and installed? Awesome, go ahead and launch it, accept the EULA and then shut it down. We won't need it anymore.</p>\n<p><strong>Command Line Tools</strong></p>\n<p>Now that we Xcode on your machine we can now install command line tools. Open up Terminal (it comes pre-installed on all macs), paste the following command into it, and press enter.</p>\n<p><code class=\"language-text\">bash xcode-select --install</code></p>\n<p>Everything go akay? Awesome!</p>\n<div class=\"meta\" markdown=\"1\">\n#### EDITOR'S NOTE\n<p>I got reports of the following error happening for a couple people:</p>\n<p><code class=\"language-text\">/usr/bin/xcode-select: /usr/bin/xcode-select: cannot execute binary file</code></p>\n<p>If you get that error just skip the step and move on.</p>\n<p>If anyone actually knows what that's about I would love to hear it in the comments.</p>\n</div>\n<p><strong>Ruby</strong></p>\n<p>Jekyll is written in Ruby and Ruby comes installed on Macs so you should be good to go but let's run a couple quick commands just to be sure.</p>\n<p>In your terminal app type the following command and press enter:</p>\n<p><code class=\"language-text\">ruby -v</code></p>\n<p>You should see something like</p>\n<p><code class=\"language-text\">ruby 2.0.0p481 (2014-05-08 revision 45883) [universal.x86_64-darwin14]</code></p>\n<p>If instead you get: <code class=\"language-text\">ruby: command not found</code> then you're gonna have to <a href=\"https://www.ruby-lang.org/en/\">install it yourself</a>.</p>\n<p><code class=\"language-text\">ruby -v</code> is a command that will tell us what version of ruby we are running. We see from the output that at the time of this writing I am running version 2.0.0p481.</p>\n<p><strong>RubyGems</strong></p>\n<p>Now that we have Ruby installed the next thing we need is RubyGems. Again if you are on a Mac you probably just have this. We'll check our version again just to be sure.</p>\n<p><code class=\"language-text\">gem -v</code></p>\n<p>Look familiar? \"gem\" is our command for RubyGems and -v is how we check the version number. This time I get <code class=\"language-text\">2.0.14</code> if you have to install it yourself you will find detailed instructions on <a href=\"https://rubygems.org/pages/download\">rubygems.org</a>.</p>\n<p>RubyGems is a package manager framework for Ruby. It's what we will use to install Jekyll later.</p>\n<p><strong>NodeJS</strong></p>\n<p>The last thing we need before we can hit that Quick-start is NodeJS. Node does not come preinstalled on anything as far as I know but the install is super easy. Just head over to <a href=\"https://nodejs.org/\">nodejs.org</a> and download the installer.</p>\n<p>Finished? Perfect. We ready.</p>\n<p>Ok, let's go line by line on the Quick-start so we fully understand what we're doing.</p>\n<div class=\"gatsby-highlight\" data-language=\"sh\"><pre class=\"language-sh\"><code class=\"language-sh\">~ $ gem install jekyll</code></pre></div>\n<p>That squiggly is called a tilde and is a shortcut for your home directory. You don't actually type it. If we were to move to another directory, say a folder on your desktop called \"untitled\" you would see something like <code class=\"language-text\">~/Desktop/untitled</code>. Again, you wouldn't actually type any of that - it's just there in the terminal so you knwo where you are.</p>\n<p>What about that dollar sign? You don't actually type that either. It just means that you are a normal user and is automatically placed at the start of every command. You only have to actually type everything that comes after the $.</p>\n<p><code class=\"language-text\">gem install jekyll</code> is the command we type into terminal to install jekyll. Technically speaking, \"gem\" is the program we want to run, \"install\" is the command, and \"jekyll\" is the argument. Together they form a nice programatic sentance.</p>\n<p>So, now that we know what we're actually doing, go ahead and install Jekyll.</p>\n<div class=\"gatsby-highlight\" data-language=\"sh\"><pre class=\"language-sh\"><code class=\"language-sh\">gem install jekyll</code></pre></div>\n<p>If you get a permissions error you may have to add <code class=\"language-text\">sudo</code> to the command. <code class=\"language-text\">sudo</code> which means \"Super User Do\" will run the command as a super user on your system and require your password. This is the password you use when logging into your computer.</p>\n<p>The sudo version of this command looks like <code class=\"language-text\">sudo gem install jekyll</code></p>\n<p>All set? Fantastic! Next we'll create our blog.</p>\n<div class=\"meta\" markdown=\"1\">\n#### EDITOR'S NOTE\n<p>From here on out I will only include the commands you actually type and forgo adding the <code class=\"language-text\">~ $</code> bits as they can be confusing since you don't actually have to type them in.</p>\n</div>\n<div class=\"gatsby-highlight\" data-language=\"sh\"><pre class=\"language-sh\"><code class=\"language-sh\">jekyll new my-awesome-site</code></pre></div>\n<p>Here we type \"jekyll\" to know what program we are running, \"new\" as our command, and \"my-awesome-site\" as the argument. \"my-awesome-site\" is the name of your site directory. It can be anything you want. If you want your site to be \"joe-bloggs-blog\" then you would type <code class=\"language-text\">jekyll new joe-bloggs-blog</code>. After you hit enter Jekyll will create a new directory (folder) with the name you passed and install all the files needed for a brand new Jekyll blog.</p>\n<p>You did it! You created your first Jekyll Blog!!!</p>\n<p>Although I suppose you want to actually see it now. For that we have a couple more quick commands.</p>\n<div class=\"gatsby-highlight\" data-language=\"sh\"><pre class=\"language-sh\"><code class=\"language-sh\">cd my-awesome-site</code></pre></div>\n<p>Here we are changing directory (cd) to our new site. Think of this as opening finder and double clicking on your sites folder. Don't forget to change \"my-awesome-site\" to whatever you named your blog.</p>\n<p>As I mentioned earlier when we talked about the ~, commands run in our current working directory. We cd (change directory) into our site directory so we can run jekyll commands in there.</p>\n<p>The last command we need to run will spin up a local server for our jekyll site so we can actually view it in a browser.</p>\n<div class=\"gatsby-highlight\" data-language=\"sh\"><pre class=\"language-sh\"><code class=\"language-sh\">jekyll serve</code></pre></div>\n<p>In your terminal \"my-awesome-site\" should be replaced with the name of your own site.</p>\n<p>Now what about this last bit in the quickstart?</p>\n<div class=\"gatsby-highlight\" data-language=\"sh\"><pre class=\"language-sh\"><code class=\"language-sh\"># =&gt; Now browse to http://localhost:4000</code></pre></div>\n<p>That hash # is the start of a comment. It's a signal to the computer that it should ignore this line. It's a special note just to you - the web developer - and you don't have to type it in. It's simply telling you to open up your favorite browser and go to localhost:4000. This is how you can access a local server on your machine to view your website before it actually goes live on the internet. So go ahead, open up your favorite browser and go to <a href=\"http://localhost:4000\">http://localhost:4000</a>...</p>\n<p>🎉</p>\n<p>Now do you feel like a web developer? You should!</p>\n<div class=\"meta\" markdown=\"1\">\n<h4>Next Up:</h4>\n<p>We'll learn how to actually write posts and pages as well as set up version control with github <em>and</em> launch our site on github. Exciting! 😁</p>\n<h3>In this series</h3>\n<p><a href=\"{{ site.baseurl }}/150602/built-with-jekyll/\">Built With Jekyll</a><br/>\n<a href=\"{{ site.baseurl }}/150616/built-with-jekyll-part2/\">Built With Jekyll Part 2</a></p>\n</div>","frontmatter":{"date":"150616","title":"Built With Jekyll Part 2","illustration":"/assets/posts/built-with-jekyll/octocat.png","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150614/switch-to-blog"}}]},"nextPostMarkdown":{"frontmatter":{"title":"switch_to_blog();"}},"previousPost":{"edges":[{"node":{"path":"/150622/alt-lab-post-grid"}}]},"previousPostMarkdown":{"frontmatter":{"title":"ALT Lab Post Grid"}}},"pageContext":{"nextPostPath":"/150614/switch-to-blog","previousPostPath":"/150622/alt-lab-post-grid"}}