{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Drink a potion. Roll a d20. Roll on modifier charts when appropriate. Rinse. Repeat. Random Effects - d20 No effect You smell like a…","html":"<p>Drink a potion. Roll a d20. Roll on modifier charts when appropriate. Rinse. Repeat.</p>\n<h3>Random Effects - d20</h3>\n<ol>\n<li>\n<p>No effect</p>\n</li>\n<li>\n<p>You smell like a beautiful flower and attract 1d100 bees. If you leave them alone they will go away after 1 minute. Otherwise...</p>\n</li>\n<li>\n<p>You fingertips swell to the size of plums. Any activity that requires the use of your fingers requires a -2 DEX check.</p>\n</li>\n<li>\n<p>All you hair turns to (roll on random color chart)</p>\n</li>\n<li>\n<p>You shrink to half your size for 24 hours</p>\n</li>\n<li>\n<p>You grow to twice your size for 24 hours</p>\n</li>\n<li>\n<p>You float up 5 feet per second for 30seconds after which you fall normally incurring any  appropriate fall damage.</p>\n</li>\n<li>\n<p>All your teeth fall out</p>\n</li>\n<li>\n<p>You notice no effect. Everything you eat tastes like lemons for 3 days.</p>\n</li>\n<li>\n<p>You notice no effect. You emit a horrible body odor for 3 days that you cannot smell.</p>\n</li>\n<li>\n<p>Your skin turns (roll on random color chart)</p>\n</li>\n<li>\n<p>You burst into ethereal flames for 30 seconds. During the first 30 seconds you incur no fire damage. After 30 seconds the flames surrounding your body extinguish Anything set alight by the flames during the 30 seconds burn with natural fire and will continue to burn afterwards. The natural fire can hurt you after the initial 30 seconds.</p>\n</li>\n<li>\n<p>Your legs become heavy for 1 hour. Every step requires a DC15 STR check. After 3 failed saves in a row become exhausted.</p>\n</li>\n<li>\n<p>You grow an additional head on your shoulder with an alignment opposite to your own. It is very opinionated and quite vocal. Any action you attempt that this head disagrees with has disadvantage.</p>\n</li>\n<li>\n<p>You grow a mouth on your forehead that speaks your inner monologue in a British accent. No secrets or thoughts are safe. Feeding it tea and crackers will temporarily keep it from talking.</p>\n</li>\n<li>\n<p>From now on whenever you roll a 5 your arms wave uncontrollably for 3 seconds before completing whatever action you rolled for.</p>\n</li>\n<li>\n<p>Hot and Cold flashes for 1 day. Odd rolls make you FREEZING! Your character will seek any and all extra clothes, blankets or heat source. Even rolls make you HOT! Your character will shed all extra clothes blankets etc and attempt to cool down however possible.</p>\n</li>\n<li>\n<p>You find yourself feeling deeply nostalgic for something you can’t quite put your finger on. During any conversations you have for the next 3 days your character must bring up aspects of their childhood longingly.</p>\n</li>\n<li>\n<p>Your skin grows to twice it’s normal size. Your skeleton and muscle structure remains the same.</p>\n</li>\n<li>\n<p>You shout sporadically. Before speaking roll a d20. If the result is divisible by 3 you shout whatever you had intended to say without realizing your voice is so loud.</p>\n</li>\n</ol>\n<h3>Random Color Chart</h3>\n<ol>\n<li>Red</li>\n<li>Orange</li>\n<li>Yellow</li>\n<li>Green</li>\n<li>Blue</li>\n<li>Violet</li>\n<li>Black</li>\n<li>White</li>\n<li>Gray</li>\n<li>Brown</li>\n</ol>","frontmatter":{"date":"160419","title":"Random Potion Effects Table","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/160418/dungeons-of-five-nights-at-freddys"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Dungeons of Five Nights at Freddy's"}},"previousPost":{"edges":[{"node":{"path":"/160420/useful-dnd-generators"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Useful DnD Generators"}}},"pageContext":{"nextPostPath":"/160418/dungeons-of-five-nights-at-freddys","previousPostPath":"/160420/useful-dnd-generators"}}