{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Writing is hard. Writing about writing code is very hard. I am not a good writer. This is hard. The act of writing code is hard to explain…","html":"<p>Writing is hard. Writing about writing code is very hard.</p>\n<p>I am not a good writer. This is hard.</p>\n<p>The act of writing code is hard to explain. I feel my way through it, often like an adventurer navigating a cave without a torch. Groping around looking for any sort of sound or sensation to offer a clue. Relying <del>mostly on intuition</del> on experience and intuition I may eventually find<del>ing</del> some iridescent moss <del>to</del> lighting <em>a</em> way. But is it <em>the</em> way? Won’t know until I've traveled down it a bit. I gather some of the moss into a crude torch and use it to light up ever deeper parts of the cave. <del>Shedding new light in the darkness. Sometimes we find this leads to the way out other times the moss fades and we are lost again only to backtrack, gather more moss and dig deeper again.</del> There are dead ends, false hopes and plenty of backtracking. Finally I can smell fresh air and bee-line for the surface.</p>\n<p>This pattern of exploration may very well lead to an exit but it doesn’t lead to a very thorough understanding. <del>Sure we</del> I got out. But I couldn’t very well tell you how. And even if I could it wouldn’t very well make sense.</p>\n<p>What the hell was I doing there anyways?<del>To be perfectly honest What was I doing in that cave anyway? No torches or plan?</del> Did I even bother to think <del>this</del> it through at all? <del>What business do I have exploring caves anyways? I don’t know what I’m doing...</del> And what business is it of mine to be exploring caves in the dark anyhow? Obviously, I have no idea what I'm doing.</p>\n<p>We recently added an intern to our team at work and one of my first comments to her (and <del>to</del> myself) was that thinking about writing code is way harder than actually writing it. Stopping to consider what you are going to do requires patience, communication, clarity of thought, and a deep understanding of the problem you are trying to solve as well as the existing code base within which you are <del>to solve it</del> working.</p>\n<p>It's actually a lot like writing code. Just with people and on a whiteboard. <del>Talking instead of doing. Talking about the doing before it begins.</del></p>\n<p><del>My problem often stems from a sense of adventure.</del> It’s a <del>lack</del> struggle of patience. I like to write code! I like to spend time exploring it, breaking it, seeing what happens when I go down this path or the other. I find exploration far easier and exhilarating than planning. Planning requires research, and discussion, and compromise. It’s hard!</p>\n<p>Hard things are hard.</p>\n<p>It would be wise to spend more time practicing hardship. I have run ultras in the past with the idea that it would help me practice hardship. <del>It certainly helped me see that through hard and consistent practice I could do</del>  Really, it just proved that I <del>was</del> am stubborn enough to <del>bull rush my way to</del> grind through a 10 hour race. <del>A single minded goal</del> Making it to the finish line isn’t <del>hard</del> complicated. You just keep going until you get there. If it hurts you keep going. If you are hungry you keep going. There are many questions in an ultra and only ever one answer.</p>\n<p>This is not the case with writing code.</p>\n<p>There are many answers. With varying degrees of correctness. These degrees can change based on the context within which you ask the question. You can be right and still be wrong and vice versa. There is great philosophical debate in this work.</p>\n<p>There are known processes that can lead to a solution. Methods of organizing what you know. Ways to map <del>the</del> a solution. I left the more traditional visual arts of design and illustration for engineering and math in the hopes of finding a more absolutist approach to answers. If the code works you are right! Of course I was <del>mistaken</del> wrong. The more you know the more you know you do not know.</p>\n<p>In every discipline of thought I find you cannot rely on your own great ideas or \"genius\". There is only process and adherence to it. There are many answers and process will illuminate them all. The trick becomes understanding which process to implement and which illuminated answer to accept.</p>\n<p><del>A well prepared explorer lives to see another day. Whereas an impromptu dungeon delve often leads to death.</del></p>\n<p><del>Preparation is key.<del>Really I should just prepare better more thoroughly.</del> It’s easy to get lost without a map. It’s foolish to go alone.</del></p>\n<p><del>It’s a lot easier to explain what you did, right or wrong, when you knew where you going the whole time. had a plan the whole time.</del></p>\n<p><del>I have a point, I swear...</del></p>\n<p><del>It’s a lot easier to explain where things went wrong when you can com</del></p>\n<p><del>I’m going to finish diagramming scribe. Or maybe just play Skyrim. Or watch TV. Or just go to bed. Sleep is important too. Plans are good. They avoid  It help to avoid these rambling tirades…</del></p>\n<p><del>The problem with impatience is code that works isn’t good enough. It should be maintainable. Transferrable. Readable.</del></p>\n<p><del>Remember: <a href=\"https://blog.codinghorror.com/coding-for-violent-psychopaths/\">Always code as if the person who ends up maintaining your code is a violent psychopath who knows where you live.</a></del></p>","frontmatter":{"date":"170610","title":"What I think about when I think about writing about writing code","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/170531/pixijs"}}]},"nextPostMarkdown":{"frontmatter":{"title":"PixiJS"}},"previousPost":{"edges":[{"node":{"path":"/170827/aglet-timekeeper-released"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Aglet Timekeeper Released"}}},"pageContext":{"nextPostPath":"/170531/pixijs","previousPostPath":"/170827/aglet-timekeeper-released"}}