{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"I like to build wordpress themes locally. Originally I used MAMP which was fine for a while but the free version has some limitations and…","html":"<p>I like to build wordpress themes locally. Originally I used MAMP which was fine for a while but the free version has some limitations and the pro version only worked well when I was doing everything alone. Once I got a team building with me the need for indentical development environments became apparent.</p>\n<p>Enter Varying Vagrant Vagrants and the VVV Site Creation Wizard.</p>\n<p>In a nutshell this sets up a virtual environment on your machine for development. Much like MAMP. The benefit I found with VVV is the environment tends to work much more smoothly across machines making collaborative development that much easier.</p>\n<p>I detailed my own <a href=\"http://luetkemj.github.io/150605/my-web-dev-setup/\">web dev tool kit</a> previously and briefly touched on Vagrant and VVV. Here we'll look take a closer look at all the tools you'll need to get a site up and rolling locally.</p>\n<p>First you will need to download and install <a href=\"https://www.virtualbox.org/wiki/Downloads\">VirtualBox</a>. This is the program that will run your virtual machine. It's a pretty indespensible tool that can be used to setup all sorts of virtual boxes from super old versions of Windows to Linux and everything in between. </p>\n<p>Once that is installed you will need <a href=\"https://www.vagrantup.com/\">Vagrant</a>. </p>\n<blockquote>\n<p>Vagrant is a tool for building complete development environments. With an easy-to-use workflow and focus on automation, Vagrant lowers development environment setup time, increases development/production parity, and <strong>makes the \"works on my machine\" excuse a relic of the past.</strong></p>\n</blockquote>\n<p>That pretty much sums it up. You can now expect that everyone on your team is working in the same environment. If it works on one machine it should work on all the others.</p>\n<p>You will need to follow the instructions in the docs to get your first <a href=\"https://github.com/Varying-Vagrant-Vagrants/VVV#the-first-vagrant-up\">Vagrant Up</a>. If you follow those docs you will not only get your first Vagrant Up but will do so with Varying Vagrants Vagrant or VVV.</p>\n<blockquote>\n<p>Varying Vagrant Vagrants is an open source Vagrant configuration focused on WordPress development. VVV is MIT Licensed.</p>\n</blockquote>\n<p>Now that you have a very nice WordPress enviro setup lets go one step further and use the VVV Site Creation Wizard to get things really rolling. This will help us setup local wordpress installs where we can finally get started developing.</p>\n<p>One more place to go - the git repo for <a href=\"https://github.com/bradp/vv\">Variable VVV</a>. You'll need <a href=\"http://brew.sh/\">Homebrew</a> to install this on a mac - there are directions for Windows installs in the readme. </p>\n<p>Okay! If you have made it this far you deserve a high five! ✋</p>\n<p>And if you've made it this far I will also assume you know how to use the terminal. Good? Good. Let's be ✨wizards✨</p>\n<style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style><div class='embed-container'><iframe src='https://www.youtube.com/embed/g0MdS1VLvHI' frameborder='0' allowfullscreen></iframe></div>","frontmatter":{"date":"150825","title":"VV Create","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150811/update-your-mother-blog"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Update Your Mother Blog"}},"previousPost":{"edges":[{"node":{"path":"/150826/wordpress-and-angular"}}]},"previousPostMarkdown":{"frontmatter":{"title":"WordPress and Angular"}}},"pageContext":{"nextPostPath":"/150811/update-your-mother-blog","previousPostPath":"/150826/wordpress-and-angular"}}