{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Cloak of Goblin Stank This cloak reeks of goblin stank. While wearing this cloak all goblinoids must make a DC20 Wisdom\nsaving throw or be…","html":"<h2>Cloak of Goblin Stank</h2>\n<p>This cloak reeks of goblin stank. While wearing this cloak all goblinoids must make a DC20 Wisdom\nsaving throw or be convinced that you are just another goblin.</p>\n<p>The wearer must make a DC15 constitution saving throw every round or vomit in disgust from the\nstank and become poisoned. On a critical fail the wearer must succeed on a DC20 constitution saving\nthrow or never be able stomach the idea of wearing the cloak again, poisoned until the party\ndiscards the cloak.</p>\n<p>The wearer is permanently sickened by the stank of goblinoids and becomes poisoned while within\n120 feet of any goblinoid.</p>\n<h2>Amulet of Goblin Luck</h2>\n<p>An amulet of 1d4 hands belonging to still living goblins. Remove a hand from the amulet and place it\non a target's skin to heal for 5 times the number of hands remaining on the amulet.</p>\n<p>When a hand is used the goblin to whom it belongs dies. If the goblin owner of an unused hand dies\nthe hand shrivels and falls off the amulet becoming unusable.</p>\n<p>Replenish the amulet with the hands of still living goblins up to a total of 6 hands. There must be\nat least one hand on the amulet at all times or it loses all power and can no longer be replenished.</p>\n<h2>Goblin Bait</h2>\n<p>Goblin Bait comes in small wooden box containing a stuffed rat and a small metal wand. Touching the\nrat with the wand causes the rat to become animated. It will follow a small red dot cast from the\ntip of the wand and vocally antagonize any goblin it sees into following it. Goblins must make a\nDC15 Wisdom save or be attracted to the bait, following it anywhere that does not knowingly lead to\ndeath.</p>","frontmatter":{"date":"160424","title":"Goblin Inspired Gear","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/160423/vi-on-pi"}}]},"nextPostMarkdown":{"frontmatter":{"title":"VI in pi"}},"previousPost":{"edges":[{"node":{"path":"/160425/raspberry-node-and-express"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Raspberry Node and Express"}}},"pageContext":{"nextPostPath":"/160423/vi-on-pi","previousPostPath":"/160425/raspberry-node-and-express"}}