{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Today I had an experience I really haven’t had the pleasure of enjoying since leaving Virginia. Lately all my runs runs have been out and…","html":"<p>Today I had an experience I really haven’t had the pleasure of enjoying since leaving Virginia. Lately all my runs runs have been out and backs on a one mile pea stone path a block from my house. The challenge here is turning around after each loop to go out again. Every lap offers a chance to bail.</p>\n<p>The green belt is different challenge altogether. It’s a 10 mile loop around a section of the Colorado River. Today I ran one loop and turned around to double up with the second in reverse. Like running in Pocahontas back in Virginia, you can get yourself in trouble. It’s easy to run too far and bonk. And yet you have to finish no matter what. With the river between you and your car you are always beyond the point of no return.</p>\n<p>One of the things that attracted me to long distance running in the first place was this very experience. I always looked at it as a means to practice hardship. So many things in life can just be bailed on when the going gets tough. Fortunately, a bonk 6 miles from your car with no money and no phone is not one of them.</p>\n<p><img src=\"http://i.imgur.com/jLY7p6w.jpg\" alt=\"Town Lake\"></p>","frontmatter":{"date":"161021","title":"Practicing Hardship","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/161017/curry"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Curry"}},"previousPost":{"edges":[{"node":{"path":"/170101/2016-year-in-review"}}]},"previousPostMarkdown":{"frontmatter":{"title":"2016 in review"}}},"pageContext":{"nextPostPath":"/161017/curry","previousPostPath":"/170101/2016-year-in-review"}}