{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"I spent last week with family in Drake Colorado. It's tiny little town on the Big Thompson right between Estes Park and Loveland. I had been…","html":"<p>I spent last week with family in Drake Colorado. It's tiny little town on the Big Thompson right between Estes Park and Loveland. I had been looking forward to this trip for some time. A great opportunity to run at elevation. A chance to get some serious vert on trails unlike anything I encounter here in the hill country of Texas.</p>\n<p>The day before I left I tweaked my back somehow. I haven't had back issues in years. Why my back decided to go out at this time I'll never know. It was a bit disappointing but probably forced me to be more hands with the kids than I would've otherwise wanted to be.</p>\n<p>The first day when my back was sore but not yet serious I went for a 7ish mile run in the mountains with 2800 feet of climbing. It was fantastic but left me wanting. I had to stop when I ran out of time for an outing scheduled with extended family. A mile and a half short of the summit with plenty of energy to go the distance I had to turn around.</p>\n<p>Despite the disappointment running that high on trails that equate to running on the edge of a cliff was exhilarating. Running back down was a whole new experience. Miles of technical downhill, I had not imagined! While I never hurt I certainly felt muscles I didn't know about before.</p>\n<p>Later we drove to 12000 feet in Rocky Mountain National Park. I could feel the blood rushing through my veins. My hands hummed with life. It was a small taste that left me wanting so much more, to move quickly at elevation...</p>\n<p>My opportunity to settle some unfinished business with the mountain came late last week. Unfortunately when I awoke I could hardly make it to the other side of the cabin let alone run 3500 feet up and down a mountain. The immature part of wanted to say \"fuck it\" and run anyways despite the spasms in my lower back. The dad in me couldn't rationalize risking my safety from a fall or just screwing my back up more. Thus I humbly declined to make the run. Responsibility sucks.</p>\n<p>Back home I am now recovering and getting itchy to go for a run. Something small and simple tonight.</p>\n<p>My Grindstone training went off the rails these last two weeks but if I've learned anything it's that I can't throw out the the race after a bad training week. I will have many of them. I made it past 40 miles two weeks ago and I had thought that was a huge long shot.</p>\n<p>One day at a time. Relentlessly ever forward.</p>","frontmatter":{"date":"160627","title":"12,000 Feet","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/160516/module-exports"}}]},"nextPostMarkdown":{"frontmatter":{"title":"module.exports"}},"previousPost":{"edges":[{"node":{"path":"/161017/curry"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Curry"}}},"pageContext":{"nextPostPath":"/160516/module-exports","previousPostPath":"/161017/curry"}}