{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Casey Neistat. This guy is cool. So cool in fact that I wanted nothing to do with him cause, well, I have issues. A friend of mine used to…","html":"<p>Casey Neistat.</p>\n<p>This guy is cool. So cool in fact that I wanted nothing to do with him cause, well, I have issues.</p>\n<p>A friend of mine used to watch Neistat videos at work while designing. Curious - given my wholey unearned lack of respect for Neistat and fully earned respect for said friend - I asked what was so interesting about the guy. He's so wierd looking... and why does he where sunglasses inside? Is that studio for real? <em>generous portions of sideeye</em></p>\n<p>He didn't have a great answer.</p>\n<p>I continued to not watch any of his videos for a couple years.</p>\n<p>A couple months ago in one of my late night alcohol fueled youtube binges a neistat video showed up in my recommended list. C'mon youtube - this guy is too cool for school. I don't want this.</p>\n<p>But caught in a moment of trying to exapnd my horizons I figured if I try and grow beyiond my middle school self.</p>\n<p>It was time I stopped disliking things for... reasons.</p>\n<p>So I gave it a go. Figured I should at least be able to articulate why I didn't care for the guy.</p>\n<p>And I quickly figured it out.</p>\n<p>Jealousy.</p>\n<p>This guys is seriously talented. Seriously disiplined. Has an amazing studio. Lives in NYC. Came from nothing.</p>\n<p>Fuck.</p>\n<p>What am I doing with my life.</p>\n<p>Getting drunk late at night and watching youtube all by myself. That's what.</p>\n<p>So turned it off. Too painful. Time to reminisce about how productive and talented I used to be. Dust off the old comics and articfacts of productivity I made in times of yore. I'm talented too. I'm disciplined... who was I kidding? I was drunk for the who knows how many nights in a row. I wasn't over the last year and all the bullshit that was. I was setting a shit example for my kids as a highly functional alcoholic.</p>\n<p>This is not the life I want.</p>\n<p>This is not the life I want for my kids.</p>\n<p>This is not my beautiful house.</p>\n<p>How did I get here?</p>\n<p>Slowly.</p>\n<p>Ever so slowly I have been digging myself out of a hole.</p>\n<p>Neistat's videos are badass because they embody flow. That magical creative place we go to when all pieces just click. When it feels easier than it. When you look at the clock and realize you skipped lunch and are now 3 pages ahead.</p>\n<p>And fucking starving.</p>\n<p>There is feeling to his videos that I miss.</p>\n<p>It's not talent. It's not easy. It's not natural.</p>\n<p>But it looks all of those things.</p>\n<p>He has earned it all.</p>\n<p>Kudos.</p>","frontmatter":{"date":"190305","title":"Neistat","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"forest-gump.jpg","publicURL":"/static/forest-gump-cb60a493d812bb1e574418382f053dce.jpg"}},{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/190108/the-druid-and-the-squirrel"}}]},"nextPostMarkdown":{"frontmatter":{"title":"The Druid and the Squirrel"}},"previousPost":null,"previousPostMarkdown":null},"pageContext":{"nextPostPath":"/190108/the-druid-and-the-squirrel","previousPostPath":null}}