{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Having depended on MAMP and PHPmyadmin for as long as I've been doing this stuff, moving to Vagrant presented me with a very real fear that…","html":"<p>Having depended on MAMP and PHPmyadmin for as long as I've been doing this stuff, moving to Vagrant presented me with a very real fear that I wouldn't be able to easily setup local installs of live sites. With MAMP I had always done a find and replace through the old Replacr app and then uploaded the DB through PHPmyadmin.</p>\n<p>It wasn't perfect but served my needs for any db under 50MB. Sadly as I have been tasked with older installs and larger DBs that restriction has become problematic. Fortunately Vagrant once again steps in to save my butt.</p>\n<p>This is mostly a command line process but I promise it's pretty basic, much faster than my previous mostly manual solution, and isn't restricted to the PHPmyadmin file size limits. These steps while specific to Vagrant make use of the WP-CLI which is not specific to Vagrant. You could probably do this with MAMP and can definietly do this on your server if you set it up proper.</p>\n<div class=\"meta\" markdown=\"1\">\n<h4>WARNING</h4>\n<p>If you are cloning a live site make sure you update your local wp-config.php file accordingly. Just copy the settings that Vagrant setup for you with the wp install.</p>\n</div>\n<h2>db import in vagrant</h2>\n<p>This assumes you installed vagrant at the default location of vagrant-local</p>\n<ol>\n<li>\n<p><strong>Rename db</strong></p>\n<p>Make sure that the db you will be importing is the same name as the db you will be importing into. So if your local site has a database name of <code class=\"language-text\">EXAMPLE.sql</code> you need to make sure that the db you will be import also has a name of <code class=\"language-text\">EXAMPLE.sql</code></p>\n</li>\n<li>\n<p><strong>Move db</strong></p>\n<p>Make a copy of the db you will be importing and move it to the root directory of the site you will be importing into.</p>\n<p><code class=\"language-text\">/vagrant-local/www/EXAMPLE/</code></p>\n</li>\n<li>\n<p><strong>ssh into vagrant</strong></p>\n<p><code class=\"language-text\">cd vagrant-local</code></p>\n<p><code class=\"language-text\">vagrant ssh</code></p>\n</li>\n<li>\n<p><strong>cd to site</strong></p>\n<p><code class=\"language-text\">cd /vagrant/www/EXAMPLE</code></p>\n</li>\n<li>\n<p><strong>Import db</strong></p>\n<p><code class=\"language-text\">wp db import DATABASE.sql</code></p>\n</li>\n<li>\n<p><strong>Search and Replace</strong> (optional)</p>\n<p>If you need to do a search and replace run the following command. It handles serialized data appropriately so you don't bugger up your site.</p>\n<p><code class=\"language-text\">wp search-replace &#39;http://example.com&#39; &#39;http://example.dev&#39;</code></p>\n</li>\n<li>\n<p><strong>Celebrate</strong> 🎉</p>\n</li>\n</ol>\n<div class=\"meta\" markdown=\"1\">\n<h4>Bits and Bobs</h4>\n<p>Commands that start with <code class=\"language-text\">wp</code> make use of the WP-CLI which comes setup with vagrant. See <a href=\"http://wp-cli.org\">http://wp-cli.org</a> for more info and available commands.</p>\n<p>Vagrant does support PHPmyadmin at vvv.dev but the upload limit is actually lower than MAMP. This limit can be changed in your PHP.ini file for MAMP and I assume in Vagrant as well but I really don't think it's worth doing with how much easier the command line method is.</p>\n<p>MAMP can <em>probably</em> do an SSH import just like Vagrant but I never learned how and am not going to at this point. If you figure it out, I'd love to hear about it.</p>\n</div>","frontmatter":{"date":"150606","title":"WP DB Import with Vagrant","illustration":"/assets/posts/wp-db-imports-with-vagrant/files.png","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150605/my-web-dev-setup"}}]},"nextPostMarkdown":{"frontmatter":{"title":"My Web Dev Tool Kit"}},"previousPost":{"edges":[{"node":{"path":"/150610/list-remote-comments"}}]},"previousPostMarkdown":{"frontmatter":{"title":"List Remote Comments"}}},"pageContext":{"nextPostPath":"/150605/my-web-dev-setup","previousPostPath":"/150610/list-remote-comments"}}