{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"This blog is built with  jekyll . That may seem like an odd choice considering what I do for a living. Wordpress is a dynamic database…","html":"<p>This blog is built with <a href=\"http://jekyllrb.com/\">jekyll</a>.</p>\n<p>That may seem like an odd choice considering what I do for a living.</p>\n<p>Wordpress is a dynamic database driven CMS with a proper admin. Setup is dead simple. Administration is smooth and clean. Most hosts provide one click installs. <a href=\"http://rampages.us\">Rampages</a> here at VCU provides free blogs to anyone with a vcu email address.</p>\n<p>Jekyll on the other hand has no database, is completely static, and has no admin. Setup requires terminal, administration can only be done in a text editor, and the best install option requires github and a working knowledge of git.</p>\n<p>So why in the world am I using Jekyll?</p>\n<p>I would argue that Jekyll is to modern web development as WordPress is to web publishing. WordPress lowers the barrier to publishing on the web. I work with people everyday who have no experience with wordpress or any web publishing platform for that matter and yet, with WordPress, can setup a website or blog and have full ownership of their past, current, and future content with minimal friction.</p>\n<p>I believe that a motivated individual could also get a site up and running with Jekyll without a background in web development with minimal friction. The primary barrier to web development is fear. Fear that you will somehow break your computer - or worse - <strong>the internet</strong>!</p>\n<p>I can assure you, the Google will be just fine :)</p>\n<p>Let's dive head first into some serious workflows and see how not that hard it really is.</p>\n<div class=\"meta\" markdown=\"1\">\n<h4>Next Up:</h4>\n<p>We'll create a new site with Jekyll and examine all the individual steps and rabbit holes along the way.</p>\n<h3>In this series</h3>\n<p><a href=\"/150602/built-with-jekyll/\">Built With Jekyll</a><br/>\n<a href=\"/150616/built-with-jekyll-part2/\">Built With Jekyll Part 2</a></p>\n</div>","frontmatter":{"date":"150602","title":"Built with Jekyll","illustration":"/assets/posts/built-with-jekyll/octocat.png","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150528/simple-signups"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Simple Signups"}},"previousPost":{"edges":[{"node":{"path":"/150605/my-web-dev-setup"}}]},"previousPostMarkdown":{"frontmatter":{"title":"My Web Dev Tool Kit"}}},"pageContext":{"nextPostPath":"/150528/simple-signups","previousPostPath":"/150605/my-web-dev-setup"}}