{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"My son found himself in trouble recently. To be honest I don’t even remember what he did. At 11, sending him to his room has lost it’s power…","html":"<p>My son found himself in trouble recently. To be honest I don’t even remember what he did. At 11, sending him to his room has lost it’s power and grounding him just sucks for everyone. So this time we decided to try and offer a lesson instead. The “punishment” here was to consistently check off a todo list without missing a single item for five days straight. There is nothing on the list he’s not already supposed to be doing. It’s fairly short, the first 4 being get dressed, brush hair, brush teeth and have breakfast. After that he has a couple chores and finally 20 minutes of drum practice.</p>\n<p>It’s been fascinating to watch him succeed and struggle with this. He almost made it five days on his first try, but a surprise invite to a slumber party left him too excited to remember to finish the list. The next day when he came home he was quite upset to realize that he would not be getting his mp3 player back and instead had had 5 more days ahead. After a down day and a pep talk he was back on board. He now has 3 perfect days under his belt and if he can finish strong will get his mp3 player back in two days.</p>\n<p>It’s taken over 2 weeks, but he has become noticeably more responsible. Chores are no longer preceded by complaints. No more is our young man flabbergasted when we tell him to do his chores. They are just a part of his routine and there is no longer the prospect of getting out go them.</p>\n<p>Watching him go through this has made me realize how inconsistent I am with my own chores. It’s tough to teach your kids good behavior when you yourself do not model it for them. So I made a todo list for myself this morning. It’s fairly ambitious, and I’m really not sure how it will go. Should I manage to stick with it I imagine I will have to sacrifice some free time activities. I wouldn’t mind at all if it ate into my internet politics time. That whole mess is leading me to an early grave.</p>\n<p>Consistency is good. My son is learning this and I'm trying to practice it.</p>","frontmatter":{"date":"170529","title":"Consistency","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/170421/mocking-modules-in-jest"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Mocking specific module functions with jest"}},"previousPost":{"edges":[{"node":{"path":"/170530/flow"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Flow"}}},"pageContext":{"nextPostPath":"/170421/mocking-modules-in-jest","previousPostPath":"/170530/flow"}}