{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"Until now grid layouts on Rampages have been handled via a combination of styles thrown in widgets, scripts in meta boxes, and the Display…","html":"<p>Until now grid layouts on Rampages have been handled via a combination of styles thrown in widgets, scripts in meta boxes, and the Display Posts Shortcode that inexplicably doesn't support pagination, strips theme styles, and doesn't provide any sort of default for the CSS challenged among us. Let's just say it's been rather... unintuitive.</p>\n<p><a href=\"https://github.com/vcualtlab/postgrid\">ALT Lab Post Grid</a> aims to provide a super simple entry to masonry layouts while providing some relatively powerful options for customization. To get started all you have to do is install the plugin and paste a single shortcode onto any post or page.</p>\n<div class=\"gatsby-highlight\" data-language=\"html\"><pre class=\"language-html\"><code class=\"language-html\">[altlab-postgrid]</code></pre></div>\n<p>Out of the box you get a paginated 3 column masonry layout for the most recent 15 posts on your site.</p>\n<p>Simple enough. But rarely are our needs ever quite that simple.</p>\n<p>The shortcode accepts a healthy set of attributes designed to cover most everything you might need. You can use any registered post type, pull from specific categories or tags, set posts per page, choose not to use pagination at all, thumbnails, excerpts, content, title, permalink, author, date, maximum column count, light or dark default theme, no theme with basic layout styling, or no styling at all.</p>\n<p>The query options here are nowhere near as robust as those in Display Posts Shortcode but this is primarily a layout plugin for a specific need here at VCU.</p>\n<p>You can read the full docs and download the plugin over on the <a href=\"https://github.com/vcualtlab/postgrid\">repo</a>.</p>\n<p>And a couple sightings in the wild:</p>\n<ul>\n<li><a href=\"http://rampages.us/camh3/blogs/twitpics/\">http://rampages.us/camh3/blogs/twitpics/</a></li>\n<li><a href=\"http://rampages.us/research/student-blogs/dr-wibberly/\">http://rampages.us/research/student-blogs/dr-wibberly/</a></li>\n</ul>","frontmatter":{"date":"150622","title":"ALT Lab Post Grid","illustration":"/assets/posts/150622/masonry.png","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150616/built-with-jekyll-part2"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Built With Jekyll Part 2"}},"previousPost":{"edges":[{"node":{"path":"/150630/mother-blogs-made-easier"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Mother Blogs Made Easier"}}},"pageContext":{"nextPostPath":"/150616/built-with-jekyll-part2","previousPostPath":"/150630/mother-blogs-made-easier"}}