{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"So tonight my son asked me to play Dungeons of  Five Nights at Freddy’s . Normally this is something I would say no to. Instead I said yes…","html":"<p>So tonight my son asked me to play Dungeons of <a href=\"https://en.wikipedia.org/wiki/Five_Nights_at_Freddy%27s\">Five Nights at Freddy’s</a>. Normally this is something I would say no to. Instead I said yes since I’m trying to gain immortality through new experiences.</p>\n<p>I was watching <a href=\"https://www.youtube.com/watch?v=6LyCC6jjcx8\">Vsauce</a> the other day and Michael was going on about how as we get older each new year is a smaller and smaller percentage of our lives. New experiences tend to stick in our minds better than the same old drudgery. So I’m giving this whole saying “Yes” thing a go.</p>\n<p>Enough preamble.</p>\n<p>Remus asked who I wanted to be. I said an electrician figuring I could do a number on the animatronics. He said there weren’t any electricians - which I find hard to believe with how many robots are in this game. I ended up going with a security guard position. Not what Rem was expecting me to pick apparently. Keeping the DM off guard!</p>\n<p>It turns out that I really didn’t have any weapons to fend off these robotic serial killers, just a flashlight and tablet. My only hope is to use a Freddy mask to trick them into leaving me alone. The problem there is the mask will shoot metal spikes into my head if I wear it for more than 15 seconds.</p>\n<p>I tried to pull apart whatever electronics I could find.  Maybe create some sort of crude taser to short circuit these psychopaths. Unfortunately there weren’t enough spare parts in the office to build anything.</p>\n<p>A few close calls with Chicka and Freddy later I try to call 911. The phone is dead and I am extremely upset with my employers who pay me a measly $150 dollars a week to risk my life guarding this horror show. Why? I don’t even know. The animatronics seem to do a fine job themselves. They could certainly handle some thief in the night.</p>\n<p>Amazingly I manage to survive the night. It’ll take some convincing to get back to work the next day. $150 is not nearly enough. What is that, $30/night? This gig is sub minimum wage!!</p>\n<p>Offering my neck to a bunch of bloodthirsty man eating animatronics hardly seems an appropriate path to immortality.</p>\n<p>Can’t wait for tomorrow!</p>","frontmatter":{"date":"160418","title":"Dungeons of Five Nights at Freddy's","illustration":"http://i.imgur.com/b84yvgr.gif","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/160418/net-creator"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Net Creator"}},"previousPost":{"edges":[{"node":{"path":"/160419/random-potion-effects-table"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Random Potion Effects Table"}}},"pageContext":{"nextPostPath":"/160418/net-creator","previousPostPath":"/160419/random-potion-effects-table"}}