{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"On Thursday of this past week, just before DnD started my brother asked if I wanted to run The Grindstone with him in 2017. The Grindstone…","html":"<p>On Thursday of this past week, just before DnD started my brother asked if I wanted to run The Grindstone with him in 2017. The Grindstone is 101.85 Miles, 23,200 ft of gain and 23,200 ft of loss. It starts at 6pm in the evening in Swoope Virginia at Camp Shenandoah. Of course I said yes.</p>\n<p>I'm under no illusion that I'm prepared for this. Even with 17 months to train I already feel the pressure on this one. I've been lucky as of late to log 6 miles in a week. I have to train for a 50 in October of this year if I want to even have a chance of qualifying. That means I need to ramp my non existent training to nearly 50 miles a week in just 2 months so I can train consistently between 50 and 70 for the next 4 months after that.</p>\n<p>Will I toe the line in 2017? I'm not sure. I have a lot of work to earn that spot. If I manage to make it to the start will I DNF? It's possible. This is a long shot for sure. Fortunately none of that really even matters as the buckle really isn't why I'm doing this.</p>\n<p>I'm doing this one for the memories. I'm doing this one for the adventure. I doing this one so I can stretch the experiences I remember of this one little life we get just a bit longer.</p>\n<p>There is nothing quite like suffering with family.</p>\n<p><img src=\"http://i.imgur.com/mII0AWl.jpg\" title=\"_.map()\">\nPhoto: <a href=\"http://tuff-it-out.blogspot.com/2011/11/grindstone-100-2nd-100-miler.html\">Zombie Mark</a></p>\n<p>Sunrise during the 2011 Grindstone 100.</p>","frontmatter":{"date":"160501","title":"100 Miles of Memories","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/160428/young-and-maps"}}]},"nextPostMarkdown":{"frontmatter":{"title":"Young and Maps"}},"previousPost":{"edges":[{"node":{"path":"/160514/many-hats"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Many Hats"}}},"pageContext":{"nextPostPath":"/160428/young-and-maps","previousPostPath":"/160514/many-hats"}}