{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"On Friday Tom and I had a long conversation on the mother blog setup we create for most of our online courses. Configuration is completely…","html":"<p>On Friday Tom and I had a long conversation on the mother blog setup we create for most of our online courses. Configuration is completely unintuitive and faculty hoping to set this up inevitably need to schedule a sitdown with us to figure it out.</p>\n<p>Probably the biggest sticking point is subscribing students to the mother blog. Currently this is handled by creating a gravity form to collect, among other things, an RSS feed from the student's blog. Even if the students are successfull in finding and submitting the url to their feed the faculty has to parse the data from a gravity form and manually enter it into FeedWordPress.</p>\n<p>Our goal then, is to create a theme, plugin, or both that will greatly improve this subscription workflow.</p>\n<p>From our discussion that workflow would look something like this:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">if ( is_logged_in() ){\n\n\tHello [Student Name],\n\n\tWhich blog would you like to subscribe this class to?\n\n\t\t[ ] Student Blog 1\n\t\t[X] Student Blog 2\n\t\t[ ] Student Blog 3\n\n\tStudent Blog 2 does not have the category [course-category] yet. Would you like us to create it for you?\n\n\t\t[X] Yes\n\t\t[ ] No thanks, I&#39;ll do it myself.\n\n\t[create course-category on Student Blog 2]\n\n\tYou&#39;re all set set. Subscribe?\n\n\t\t[X] Yes\n\t\t[ ] Nope, I changed my mind.\n\n\t[combine url and category data from choices to build a proper feed url and create the feed in FeedWordPress]\n\n} else {\n\n\tPrompt sign in, signup, or workflow to submit a feed from another source.\n\n}</code></pre></div>\n<p>On Friday I knew or at least had a lead on how to do everything in that workflow except for creating a category on Student Blog 2. I spent a fair amount of time Friday afternoon and this weekend digging around for answers and posting on various forums looking for an answer. Never got a response. Apparently this is not a common problem.</p>\n<p>Creating a category on a blog is no big deal, the difficulty here came in that I was trying to do it on another blog in the network. I had no way of passing a blog id in any of the functions I had found that could presumably accomplish this task. The only way to create a category on a blog was from the blog itself.</p>\n<p>Which is exactly where <code class=\"language-text\">switch_to_blog();</code> comes in. It will (as far as wordpress is concerned) switch you to anyother blog on the network allowing you to create a category on whatever blog you want. Then you just switch back and hey presto - job's done.</p>\n<script src=\"https://gist.github.com/luetkemj/a8a0b317cb58ed5ec136.js\"></script>\n<p>Super excited to have this hurdle out of the way.</p>\n<p>Now to build that workflow...</p>","frontmatter":{"date":"150614","title":"switch_to_blog();","illustration":"/assets/posts/switch-to-blog/full-switchboard.png","layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/luetkemj.website/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/150610/list-remote-comments"}}]},"nextPostMarkdown":{"frontmatter":{"title":"List Remote Comments"}},"previousPost":{"edges":[{"node":{"path":"/150616/built-with-jekyll-part2"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Built With Jekyll Part 2"}}},"pageContext":{"nextPostPath":"/150610/list-remote-comments","previousPostPath":"/150616/built-with-jekyll-part2"}}