{"data":{"site":{"siteMetadata":{"title":"luetkemj","description":"Change Is Good","author":"mark luetke"}},"markdownRemark":{"excerpt":"After over a year of tinkering in the garage building RPG tools I finally  released one to the world . It’s a simple timekeeper. It keeps…","html":"<p>After over a year of tinkering in the garage building RPG tools I finally <a href=\"http://aglet.io/tools/timekeeper/\">released one to the world</a>. It’s a simple timekeeper. It keeps track of the sun, the moon, and it’s phases. You can advance time with a set of predefined buttons, reset to start or undo your last action.</p>\n<div style=\"text-align: center; margin-bottom: 15px;\">\n<img width=\"287\" alt=\"Aglet Timekeeper\" src=\"https://user-images.githubusercontent.com/925980/29755139-c711c6d4-8b58-11e7-886b-e9c17ce0ffc4.png\">\n</div>\n<p>I have learned a ton in the long process that has been building this seemingly tiny thing. It all began as a means to get up to speed with proper software engineering. So of course being a naive designer who found himself on an engineering team I started with a design and a mountain of scope creep. Early on a far more experienced colleague of mine saw the timekeeper and suggested I release that by itself. “That’s an app!” he said. \"But it’s not done!” I said.</p>\n<p>So another year was spent building out one crazy idea after another trying to get to done. Eventually I realized he was right and if anything was ever going to be released it would have to be something simple like the timekeeper. It would offer a chance for actual user feedback and build an audience for paid products down the line.</p>\n<p>It only took an evening to excise the timekeeper into it’s own working app. But of course it wasn’t 'done yet' so I committed to fully customizable increment and decrement buttons, a 12 and 24 hour time format and all manner of other custom settings. A few weeks later I again showed my work to the previously mentioned older and wiser engineer and his response was “Woah! What’s with all the buttons?”</p>\n<p>'All the buttons' were a slew of features I thought people might use with no understanding of what they actually wanted. Again, trying to build a mature production ready app without ever producing a minimal viable product.</p>\n<p>In an attempt to try and prove that something had finally been learned it was again back to the drawing board. All the extraneous features were stripped out leaving only the necessary functionality to do what a timekeeper is supposed to do. Users could now begin asking for features that they actually wanted instead of ignoring the things I thought they would like. <a href=\"https://www.reddit.com/r/DnDBehindTheScreen/comments/6w9vsx/free_timekeeper_app_i_made_for_your_games/\">And ask they did!</a></p>\n<p>Post release there has been a lot of great feedback. The most requested feature by far has been customizable lunar cycles. No one asked for a 24 hour time format. And there was only one request for custom buttons.</p>\n<p>Requested features in no particular order:</p>\n<ul>\n<li>Custom date display for alternative calendars</li>\n<li>Custom length of day / week / month / year</li>\n<li>Custom day / month / year names</li>\n<li>Planar alignment</li>\n<li>Custom lunar cycles</li>\n<li>Multiple moons each with unique lunar cycles</li>\n<li>Multiple suns</li>\n<li>Holidays and special event tracking</li>\n<li>Weather</li>\n<li>Customizable buttons</li>\n<li>Import / Export data across machines</li>\n<li>Android release</li>\n<li>Campaign setting presets</li>\n<li>Timers</li>\n</ul>\n<p>This is a big list. Not everything will make it to production. But now with the knowledge of what users actually want features can be prioritized and implemented accordingly.</p>\n<p>There's a lot more to be gleaned from this experience and plenty of learnings to come. But after a year of learning by doing I can finally say mission accomplished! Now on to those feature requests...</p>","frontmatter":{"date":"170827","title":"Aglet Timekeeper Released","illustration":null,"layout":"post"}},"allFile":{"edges":[{"node":{"relativePath":"luetkemj.png","publicURL":"/static/luetkemj-1831991e0e0c9cc03aa10eca078afa54.png"}}]},"nextPost":{"edges":[{"node":{"path":"/170610/what-I-think-about-when-I-think-about-writing-about-writing-code"}}]},"nextPostMarkdown":{"frontmatter":{"title":"What I think about when I think about writing about writing code"}},"previousPost":{"edges":[{"node":{"path":"/170902/experiencing-flow"}}]},"previousPostMarkdown":{"frontmatter":{"title":"Experiencing Flow"}}},"pageContext":{"nextPostPath":"/170610/what-I-think-about-when-I-think-about-writing-about-writing-code","previousPostPath":"/170902/experiencing-flow"}}